# FabricParamSharedFamilyKey Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamSharedFamilyKey Property
ParameterTypeId Class See Also
---
"Shared family key"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamSharedFamilyKey { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamSharedFamilyKey As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamSharedFamilyKey {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace